In [1]:
import pandas as pd

In [2]:
path="D:\PROJECT\Housing.csv"

In [4]:
df = pd.read_csv(path)

In [5]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [7]:
df.shape

(545, 13)

In [8]:
df.info

<bound method DataFrame.info of         price  area  bedrooms  bathrooms  stories mainroad guestroom basement  \
0    13300000  7420         4          2        3      yes        no       no
1    12250000  8960         4          4        4      yes        no       no
2    12250000  9960         3          2        2      yes        no      yes
3    12215000  7500         4          2        2      yes        no      yes
4    11410000  7420         4          1        2      yes       yes      yes
..        ...   ...       ...        ...      ...      ...       ...      ...
540   1820000  3000         2          1        1      yes        no      yes
541   1767150  2400         3          1        1       no        no       no
542   1750000  3620         2          1        1      yes        no       no
543   1750000  2910         3          1        1       no        no       no
544   1750000  3850         3          1        2      yes        no       no

    hotwaterheating airconditioning  parking prefarea furnishingstatus
0                no             yes        2      yes        furnished
1                no             yes        3       no        furnished
2                no              no        2      yes   semi-furnished
3                no             yes        3      yes        furnished
4                no             yes        2       no        furnished
..              ...             ...      ...      ...              ...
540              no              no        2       no      unfurnished
541              no              no        0       no   semi-furnished
542              no              no        0       no      unfurnished
543              no              no        0       no        furnished
544              no              no        0       no      unfurnished

[545 rows x 13 columns]>

In [10]:
df[['area', 'price']].head()

   area     price
0  7420  13300000
1  8960  12250000
2  9960  12250000
3  7500  12215000
4  7420  11410000

In [12]:
df[['area', 'price']].tail()

     area    price
540  3000  1820000
541  2400  1767150
542  3620  1750000
543  2910  1750000
544  3850  1750000

In [13]:
df['area']

0      7420
1      8960
2      9960
3      7500
4      7420
       ...
540    3000
541    2400
542    3620
543    2910
544    3850
Name: area, Length: 545, dtype: int64

In [15]:
df.loc[0]

price                13300000
area                     7420
bedrooms                    4
bathrooms                   2
stories                     3
mainroad                  yes
guestroom                  no
basement                   no
hotwaterheating            no
airconditioning           yes
parking                     2
prefarea                  yes
furnishingstatus    furnished
Name: 0, dtype: object

In [16]:
df.loc[0:2]

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished

In [18]:
df.loc[:2, 'area']

0    7420
1    8960
2    9960
Name: area, dtype: int64

In [19]:
df.loc[:2, ['area', 'price']]

   area     price
0  7420  13300000
1  8960  12250000
2  9960  12250000

In [20]:
df.iloc[0]

price                13300000
area                     7420
bedrooms                    4
bathrooms                   2
stories                     3
mainroad                  yes
guestroom                  no
basement                   no
hotwaterheating            no
airconditioning           yes
parking                     2
prefarea                  yes
furnishingstatus    furnished
Name: 0, dtype: object

In [22]:
df.iloc[:2,1]

0    7420
1    8960
Name: area, dtype: int64

In [24]:
df['mainroad'].unique()

array(['yes', 'no'], dtype=object)

In [25]:
df['mainroad'].nunique()

2

In [26]:
df.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [27]:
df['area'].unique()

array([ 7420,  8960,  9960,  7500,  8580, 16200,  8100,  5750, 13200,
        6000,  6550,  3500,  7800,  6600,  8500,  4600,  6420,  4320,
        7155,  8050,  4560,  8800,  6540,  8875,  7950,  5500,  7475,
        7000,  4880,  5960,  6840,  7482,  9000,  6360,  6480,  4300,
        7440,  6325,  5150, 11440,  7680,  8880,  6240, 11175,  7700,
       12090,  4000,  5020,  4040,  4260,  6500,  5700, 10500,  3760,
        8250,  6670,  3960,  7410,  5000,  6750,  4800,  7200,  4100,
        6400,  6350,  4500,  5450,  3240,  6615,  8372,  9620,  6800,
        8000,  6900,  3700,  7020,  7231,  6254,  7320,  6525, 15600,
        7160, 11460,  5828,  5200,  5400,  4640,  5800,  6660,  4700,
        5136,  4400,  3300,  3650,  6100,  2817,  7980,  3150,  6210,
        6825,  6710,  6450, 10269,  8400,  5300,  3800,  9800,  8520,
        6050,  7085,  3180,  3410,  3000, 11410,  5720,  3540,  7600,
       10700,  8150,  4410,  7686,  2800,  5948,  4200,  4520,  4095,
        4120,  4770,  6300,  2970,  6720,  4646, 12900,  3420,  4995,
        4350,  4160,  6040,  6862,  4815,  9166,  6321, 10240,  6440,
        5170,  3630,  9667,  3745,  3880,  5680,  2870,  5010,  4510,
        3840,  3640,  2550,  5320,  5360,  3520,  4990,  3510,  3450,
        9860,  5885,  3162,  3750,  3968,  4900,  2880,  4920,  4950,
        3900,  1905,  4075,  4032, 10360,  3400,  2175,  4360,  7770,
        6650,  2787,  5040,  5850,  2610,  2953,  2747,  2325,  4079,
        2145,  4840,  4080,  4046,  4632,  5985,  6060,  3600,  3680,
        5600,  5900,  4992,  4340,  3460,  4050,  7260,  3290,  3816,
        8080,  3780,  7152,  3850,  2015,  2176,  3350,  4820,  5830,
        2856,  2520,  6930,  3480,  6020,  3584,  3120,  5640,  4280,
        3570,  4130,  2850,  2275,  4240,  2135,  3036,  3990,  7424,
        7350,  3512,  9500,  5880, 12944,  3060,  3185,  1950,  4785,
        4960,  4750,  3720,  3100,  2700,  4775,  2500,  3792,  3930,
        4370,  2684,  3986,  1650,  3069,  5495,  2398,  2160,  3090,
        2835,  5076,  4352,  3660,  3040,  2640,  2650,  3934,  2000,
        2430,  2910,  3210,  3635,  2475,  3264,  1836,  3970,  2400,
        3360,  1700,  3649,  2990,  3620])

In [28]:
df['mainroad'].value_counts()

mainroad
yes    468
no      77
Name: count, dtype: int64

In [29]:
df[df['mainroad']=='yes'].head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [30]:
df['mainroad']=='yes'

0       True
1       True
2       True
3       True
4       True
       ...
540     True
541    False
542     True
543    False
544     True
Name: mainroad, Length: 545, dtype: bool

In [33]:
df[(df['mainroad']=='yes') & (df['basement']=='no')].head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
6,10150000,8580,4,3,4,yes,no,no,no,yes,2,yes,semi-furnished
7,10150000,16200,5,3,2,yes,no,no,no,no,0,no,unfurnished
9,9800000,5750,3,2,4,yes,yes,no,no,yes,1,yes,unfurnished

In [34]:
df.groupby('mainroad')['area'].mean()

mainroad
no     3606.441558
yes    5404.591880
Name: area, dtype: float64

In [35]:
df.groupby('stories')['area'].mean()

stories
1    5289.823789
2    4756.945378
3    5316.641026
4    6506.170732
Name: area, dtype: float64

In [38]:
df.groupby('mainroad')['area'].mean().reset_index()

  mainroad         area
0       no  3606.441558
1      yes  5404.591880

In [49]:
df.groupby(['stories', 'mainroad'])[['area','price']].mean()

                         area         price
stories mainroad
1       no        3554.243243  3.047923e+06
        yes       5627.805263  4.389297e+06
2       no        3590.236842  3.683750e+06
        yes       4978.620000  4.969335e+06
3       no        4880.000000  4.480000e+06
        yes       5340.243243  5.750595e+06
4       yes       6506.170732  7.208450e+06

In [50]:
df.groupby(['stories', 'mainroad'])[['area','price']].mean().reset_index()

   stories mainroad         area         price
0        1       no  3554.243243  3.047923e+06
1        1      yes  5627.805263  4.389297e+06
2        2       no  3590.236842  3.683750e+06
3        2      yes  4978.620000  4.969335e+06
4        3       no  4880.000000  4.480000e+06
5        3      yes  5340.243243  5.750595e+06
6        4      yes  6506.170732  7.208450e+06